{
    "err": {
        
        "GEN_NO_NODE_MATCH" : "No se han encontrado nodos que cumplan las requisitos especificados por la restricción",
        "GEN_NO_INTERNET": "No se han encontrado ningún nodo del tipo Internet",
        "GEN_NO_PATH_INTERNET": "No se han encontrado ningún camino hacia Internet",
        "GEN_NODE_SECURITY": "Existen nodos con una configuración de seguridad incorrecta",
        
        "DH_WRONG_RANGE" : "Se está recibiendo un rango incorrecto de IPs (de otro servidor DHCP)",
        "DH_NO_IP": "No se está recibiendo el rango correcto de IPs (en al menos un AP/VAP/zona)",
        "DH_SEVERAL_DHCPS": "Se están recibiendo IPs de más de un servidor DHCP (en al menos un AP/VAP/zona)",
        
        "CP_PATH_NO_CP" : "Existe al menos un camino que permite acceder a Internet sin pasar por un portal cautivo",
        "CP_NO_RADIUS" : "No hay conectividad entre el portal cautivo y un servidor RADIUS",
        "CP_NO_PATH_INTERNET": "No se ha encontrado ningún camino hacia Internet pasando por un portal cautivo",
        
        "WE_NO_PATH_RADIUS": "No hay conectividad de al menos un AP/VAP con un servidor RADIUS",
        "WE_PASSWORD_MISMATCH": "La contraseña del punto de acceso no coincide con la que tiene asociada en el servidor RADIUS",
        
        "ZN_NO_FRONTIER_NODE": "No se han encontrado nodos frontera de zona(wireless-link, etc.) que cumplan las requisitos especificados por la restricción",
        "ZN_NO_ZONE_CANDIDATES": "No se han encontrado candidatos a formar parte de la zona (revisar propiedades de los nodos)",
        "ZN_ZONE_CONFLICT": "Conflicto de zonas. Comprueba el campo zone de los wireless-link y que todos los nodos están conectados a su wireless-link y no a otros"
        
    },
    "ui" :
        {
        "ZONE_CONFLICT": "CONFLICTO DE ZONAS",
        
        "TAB_TITLE": "Redes Inámbricas. Práctica 4.3",
        "WINDOW_TITLE": "REDES INALÁMBRICAS. Práctica 4.3. Diseño del esquema lógico de red",
        
        "button": {
            "EVALUATE": "Evaluar red",
            "CHANGE_ITEM_PROPS": "Cambiar propiedades "
        },
        "ITEM_PROPS_TITLE": "Propiedades del elemento",
        "NODE_PROPS_TITLE": "Propiedades del nodo",
        "LINK_PROPS_TITLE": "Propiedades del enlace entre "
        
    }
}